Repository: common-repository/barestho
Catalog: languages/barestho-*.po
Languages: fr_fr

source: Restaurant ID
fr_fr: ID de votre restaurant

source: Restaurant Color Code
fr_fr: Code couleur de votre restaurant

source: How to configure the plugin and display the booking widget on your site?
fr_fr: Comment configurer le plugin et afficher le widget de réservation sur votre site ?

source: Preview Changes
fr_fr: Prévisualiser les changements

source: Save Changes
fr_fr: Sauvegarder les changements

source: Widget Display
fr_fr: Affichage du widget

source: Toggle mode
fr_fr: Mode toggle

source: Popup mode
fr_fr: Mode popup

source: In-page mode
fr_fr: Mode in-page

source: Create or modify a button.
fr_fr: Créez ou modifiez un bouton.

source: Add the barestho.openPopup('id of your restaurant') function to the onclick of your button. Make sure you enter the id of your restaurant, for example ('barestho').
fr_fr: Ajoutez la fonction barestho.openPopup(‘id de votre restaurant’) sur le onclick de votre bouton. Attention de bien mettre l'id de votre restaurant, par exemple (‘barestho’).

source: Save and check that the button works correctly.
fr_fr: Enregistrez et vérifiez que le bouton ouvre le popup correctement.

source: Example:
fr_fr: Exemple :

source: Create a "Custom HTML" tag.
fr_fr: Créez une balise "Custom HTML".

source: Add <code>[barestho_inpage]</code> inside the tag.
fr_fr: Ajoutez <code>[barestho_inpage]</code> dans la balise.

source: Check that the widget appears.
fr_fr: Vérifiez que le widget apparaît.

source: Restaurant Settings
fr_fr: Paramètres de votre restaurant

source: Your Restaurant ID
fr_fr: ID de votre restaurant

source: Barestho Logo Choice
fr_fr: Choix du logo Barestho

source: Disable mode
fr_fr: Désactiver

source: Enable mode
fr_fr: Activer le mode

source: Settings saved.
fr_fr: Paramètres sauvegardés.

source: Plugin to display the booking widget.
fr_fr: Plugin pour afficher le widget de réservation.
